# Задача 4. Шаблоны (templates) и элементы метапрограммирования

## Подзадача 1. Кортежи (tuples)

Реализуйте оператор для печати `std::tuple`. Должен работать код наподобие следующего:
```C++
// кортеж может быть любым возможным, не обязательно 3 этих типа
std::tuple<int, std::string, double> t = {5, "abcd", 3.14};
// выводит (5, abcd, 3.14). Вместо std::cout может быть файловый поток (ofstream)
std::cout << t; 
```
Вы ограничены возможностями стандарта С++11. Это означает, что нельзя, например, использовать `if constexpr`, `std::integer_sequence/std::index_sequence` и fold expressions, т.к. они появились в более поздних версиях. _(Этот запрет действует только здесь; в допах этой подзадачи и в следующих подзадачах его нет.)_

**Дополнительно:** 

1. Сделайте другую реализацию, на этот раз используя `if constexpr`.
2. Сделайте ещё одну реализацию, используя выражения свёртки (fold expressions) и, если понадобится, `std::integer_sequence/std::index_sequence`.
3. Реализуйте собственный вариант шаблонного класса `tuple`.
4. Напишите программу, которая компилируется дольше 1 минуты. Успешная компиляция не требуется.y

